"""

    a1z26 Cipher

    'فانکشن او آر دی برای ما عدد یونیک هر کاراکتر رو بر میگردونه'
    'فانکشن سی اچ آر برای ما با دادن عدد، کارکترشو برمیگردونه'
    'کدها خیلی خوانا هست و نیازی به توضیح اضافه نداره'
    'تنها موردی که ممکنه نیاز به مطالعه داشته باشه، مبحث جنریتور ها است که در اینجا استفاده شد'

"""

def encript(string):
    return [ord(i) - 92 for i in string] # برای اینکه مقداری شکوندن رمز رو سخت تر کنیم ازش مقداری رو کم یا زیاد میکنیم

print(encript('Mahdi'))



def decript(array):
    return ''.join((chr(i + 92) for i in array)) # برای اینکه بتونیم درست رمزگشایی کنیم باید همون مقداری که کم و زیاد کردیم رو بهش بدیم

print(decript([-15, 5, 12, 8, 13]))