# Logarithm Time O(log n)

"""
    این الگوریتم که اینجا نوشتم خیلی بدرد بخور نیست چرا که اگر دیتا بزرگ باشه
    و آیتم مدنظر ما هم آخرینش باشه، این باید کلی بگرده تا پیداش کنه
    و عملا این الگوریتم هیچ بدردی نمیخوره
    در اینجا باید از روش سرچ باینری استفاده کرد که میاد و از بیگ او لگاریتمی استفاده میکنه
    و کار رو خیلی سریع میکنه در دیتای بزرگ

"""

numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9]

def show(list, element):
    for i in list:
        if i == element:
            return list.index(i)
    
    return 'not found...'


print(show(numbers, 8))