"""

    Top One
        [1, 1, 2, 2, 3] => [1, 2]

"""

"""
در الگوریتم زیر ما سه متغیر میسازیم که هر کدام وظیفه خودشون رو دارند

متغییر ولیو: با اولین حلقه فور پر میشود

اولین حلقه فور: میاد هر کدام از آیتم های اون لیست رو میگیره و 
برای بار اول در یک دیکشنری قرار میگیرد با ولیو یک.
برای بار دوم اگر مقداری که در لیست است، قبلا یک بار در متغییر ولیو ذخیره شده باشد،
کلید رو بعلاوه یک میکند.

متغییر اف_ولیو: میاد و در ولیوهای دیکشنری میگردد و بزرگ ترین عدد رو پیدا و در خود ذخیره میکند

حلقه دوم: در ازای هر کلیدی که در متغییر ولیو است، ولیو اون کلید رو با مقدار اف_ولیو
مقایسه میکند و اگر برابر بود، به ریسالت ما می افزاید.

در نهایت ریسالت و اف_ولیو رو بر میگردانیم

"""


def top(array):
    values = {}
    result = []
    f_value = 0

    for i in array:
        if i in values:
            values[i] += 1
        else:
            values[i] = 1

    f_value = max(values.values())

    for i in values.keys():
        if values[i] == f_value:
            result.append(i)
        else:
            continue

    return result, f_value


print(top([1, 1, 2, 2, 3, 3, 3, 3, 3]))